vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/USART_TYPE_A_registers.h
/* Common USART_TYPE_A — generated by stm32_reggen.py.
 * Do not edit this file manually!
 * Superset across: stm32f030, stm32g070, stm32h503, stm32c092
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "USART_TYPE_A_index.h"

typedef union {
	struct {
		uint32_t UE            : 1; // /*!< USART Enable */
		uint32_t UESM          : 1; // /*!< USART Enable in STOP Mode */
		uint32_t RE            : 1; // /*!< Receiver Enable */
		uint32_t TE            : 1; // /*!< Transmitter Enable */
		uint32_t IDLEIE        : 1; // /*!< IDLE Interrupt Enable */
		uint32_t RXNEIE_RXFNEIE: 1; // /*!< RXNE/RXFIFO not empty Interrupt Enable */
		uint32_t TCIE          : 1; // /*!< Transmission Complete Interrupt Enable */
		uint32_t TXEIE_TXFNFIE : 1; // /*!< TXE/TXFIFO not full Interrupt Enable */
		uint32_t PEIE          : 1; // /*!< PE Interrupt Enable */
		uint32_t PS            : 1; // /*!< Parity Selection */
		uint32_t PCE           : 1; // /*!< Parity Control Enable */
		uint32_t WAKE          : 1; // /*!< Receiver Wakeup method */
		uint32_t M             : 1; // /*!< [M1:M0] Word length */
		uint32_t MME           : 1; // /*!< Mute Mode Enable */
		uint32_t CMIE          : 1; // /*!< Character match interrupt enable */
		uint32_t OVER8         : 1; // /*!< Oversampling by 8-bit or 16-bit mode */
		uint32_t DEDT          : 5; // /*!< DEDT[4:0] bits (Driver Enable Deassertion Time) */
		uint32_t DEAT          : 5; // /*!< DEAT[4:0] bits (Driver Enable Assertion Time) */
		uint32_t RTOIE         : 1; // /*!< Receive Time Out interrupt enable */
		uint32_t EOBIE         : 1; // /*!< End of Block interrupt enable */
		uint32_t M_1           : 1; 
		uint32_t FIFOEN        : 1; // /*!< FIFO mode enable */
		uint32_t TXFEIE        : 1; // /*!< TXFIFO empty interrupt enable */
		uint32_t RXFFIE        : 1; // /*!< RXFIFO Full interrupt enable */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_usart_type_a,cr1);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_usart_type_a,cr1),bits);

typedef union {
	struct {
		uint32_t SLVEN         : 1; // /*!< Synchronous Slave mode enable */
		uint32_t _reserved1    : 2;
		uint32_t DIS_NSS       : 1; // /*!< NSS input pin disable for SPI slave selection */
		uint32_t ADDM7         : 1; // /*!< 7-bit or 4-bit Address Detection */
		uint32_t LBDL          : 1; // /*!< LIN Break Detection Length */
		uint32_t LBDIE         : 1; // /*!< LIN Break Detection Interrupt Enable */
		uint32_t _reserved7    : 1;
		uint32_t LBCL          : 1; // /*!< Last Bit Clock pulse */
		uint32_t CPHA          : 1; // /*!< Clock Phase */
		uint32_t CPOL          : 1; // /*!< Clock Polarity */
		uint32_t CLKEN         : 1; // /*!< Clock Enable */
		uint32_t STOP          : 2; // /*!< STOP[1:0] bits (STOP bits) */
		uint32_t LINEN         : 1; // /*!< LIN mode enable */
		uint32_t SWAP          : 1; // /*!< SWAP TX/RX pins */
		uint32_t RXINV         : 1; // /*!< RX pin active level inversion */
		uint32_t TXINV         : 1; // /*!< TX pin active level inversion */
		uint32_t DATAINV       : 1; // /*!< Binary data inversion */
		uint32_t MSBFIRST      : 1; // /*!< Most Significant Bit First */
		uint32_t ABREN         : 1; // /*!< Auto Baud-Rate Enable*/
		uint32_t ABRMODE       : 2; // /*!< ABRMOD[1:0] bits (Auto Baud-Rate Mode) */
		uint32_t RTOEN         : 1; // /*!< Receiver Time-Out enable */
		uint32_t ADD           : 8; // /*!< Address of the USART node */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_usart_type_a,cr2);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_usart_type_a,cr2),bits);

typedef union {
	struct {
		uint32_t EIE           : 1; // /*!< Error Interrupt Enable */
		uint32_t IREN          : 1; // /*!< IrDA mode Enable */
		uint32_t IRLP          : 1; // /*!< IrDA Low-Power */
		uint32_t HDSEL         : 1; // /*!< Half-Duplex Selection */
		uint32_t NACK          : 1; // /*!< SmartCard NACK enable */
		uint32_t SCEN          : 1; // /*!< SmartCard mode enable */
		uint32_t DMAR          : 1; // /*!< DMA Enable Receiver */
		uint32_t DMAT          : 1; // /*!< DMA Enable Transmitter */
		uint32_t RTSE          : 1; // /*!< RTS Enable */
		uint32_t CTSE          : 1; // /*!< CTS Enable */
		uint32_t CTSIE         : 1; // /*!< CTS Interrupt Enable */
		uint32_t ONEBIT        : 1; // /*!< One sample bit method enable */
		uint32_t OVRDIS        : 1; // /*!< Overrun Disable */
		uint32_t DDRE          : 1; // /*!< DMA Disable on Reception Error */
		uint32_t DEM           : 1; // /*!< Driver Enable Mode */
		uint32_t DEP           : 1; // /*!< Driver Enable Polarity Selection */
		uint32_t _reserved16   : 1;
		uint32_t SCARCNT       : 3; // /*!< SCARCNT[2:0] bits (SmartCard Auto-Retry Count) */
		uint32_t WUS           : 2; // /*!< WUS[1:0] bits (Wake UP Interrupt Flag Selection) */
		uint32_t WUFIE         : 1; // /*!< Wake Up Interrupt Enable */
		uint32_t TXFTIE        : 1; // /*!< TXFIFO threshold interrupt enable */
		uint32_t TCBGTIE       : 1; // /*!< Transmission Complete Before Guard Time Interrupt Enable */
		uint32_t RXFTCFG       : 3; // /*!< RXFIFO FIFO threshold configuration */
		uint32_t RXFTIE        : 1; // /*!< RXFIFO threshold interrupt enable */
		uint32_t TXFTCFG       : 3; // /*!< TXFIFO threshold configuration */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_usart_type_a,cr3);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_usart_type_a,cr3),bits);

typedef union {
	struct {
		uint32_t BRR           :16; // Baud rate register [15:0]
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_usart_type_a,brr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_usart_type_a,brr),bits);

typedef union {
	struct {
		uint32_t PSC           : 8; // /*!< PSC[7:0] bits (Prescaler value) */
		uint32_t GT            : 8; // /*!< GT[7:0] bits (Guard time value) */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_usart_type_a,gtpr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_usart_type_a,gtpr),bits);

typedef union {
	struct {
		uint32_t RTO           :24; // /*!< Receiver Time Out Value */
		uint32_t BLEN          : 8; // /*!< Block Length */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_usart_type_a,rtor);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_usart_type_a,rtor),bits);

typedef union {
	struct {
		uint32_t ABRRQ         : 1; // /*!< Auto-Baud Rate Request */
		uint32_t SBKRQ         : 1; // /*!< Send Break Request */
		uint32_t MMRQ          : 1; // /*!< Mute Mode Request */
		uint32_t RXFRQ         : 1; // /*!< Receive Data flush Request */
		uint32_t TXFRQ         : 1; // Transmit data flush Request
		uint32_t _reserved5    :27;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_usart_type_a,rqr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_usart_type_a,rqr),bits);

typedef union {
	struct {
		uint32_t PE            : 1; // /*!< Parity Error */
		uint32_t FE            : 1; // /*!< Framing Error */
		uint32_t NE            : 1; // /*!< Noise detected Flag */
		uint32_t ORE           : 1; // /*!< OverRun Error */
		uint32_t IDLE          : 1; // /*!< IDLE line detected */
		uint32_t RXNE_RXFNE    : 1; // /*!< Read Data Register Not Empty/RXFIFO Not Empty */
		uint32_t TC            : 1; // /*!< Transmission Complete */
		uint32_t TXE_TXFNF     : 1; // /*!< Transmit Data Register Empty/TXFIFO Not Full */
		uint32_t LBDF          : 1; // /*!< LIN Break Detection Flag */
		uint32_t CTSIF         : 1; // /*!< CTS interrupt flag */
		uint32_t CTS           : 1; // /*!< CTS flag */
		uint32_t RTOF          : 1; // /*!< Receiver Time Out */
		uint32_t EOBF          : 1; // /*!< End Of Block Flag */
		uint32_t UDR           : 1; // /*!< SPI Slave Underrun Error Flag */
		uint32_t ABRE          : 1; // /*!< Auto-Baud Rate Error */
		uint32_t ABRF          : 1; // /*!< Auto-Baud Rate Flag */
		uint32_t BUSY          : 1; // /*!< Busy Flag */
		uint32_t CMF           : 1; // /*!< Character Match Flag */
		uint32_t SBKF          : 1; // /*!< Send Break Flag */
		uint32_t RWU           : 1; // /*!< Receive Wake Up from mute mode Flag */
		uint32_t WUF           : 1; // /*!< Wake Up from stop mode Flag */
		uint32_t TEACK         : 1; // /*!< Transmit Enable Acknowledge Flag */
		uint32_t REACK         : 1; // /*!< Receive Enable Acknowledge Flag */
		uint32_t TXFE          : 1; // /*!< TXFIFO Empty Flag */
		uint32_t RXFF          : 1; // /*!< RXFIFO Full Flag */
		uint32_t TCBGT         : 1; // /*!< Transmission Complete Before Guard Time Completion Flag */
		uint32_t RXFT          : 1; // /*!< RXFIFO Threshold Flag */
		uint32_t TXFT          : 1; // /*!< TXFIFO Threshold Flag */
		uint32_t _reserved28   : 4;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_usart_type_a,isr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_usart_type_a,isr),bits);

typedef union {
	struct {
		uint32_t PECF          : 1; // /*!< Parity Error Clear Flag */
		uint32_t FECF          : 1; // /*!< Framing Error Clear Flag */
		uint32_t NECF          : 1; // /*!< Noise Error detected Clear Flag */
		uint32_t ORECF         : 1; // /*!< OverRun Error Clear Flag */
		uint32_t IDLECF        : 1; // /*!< IDLE line detected Clear Flag */
		uint32_t TXFECF        : 1; // /*!< TXFIFO Empty Clear Flag */
		uint32_t TCCF          : 1; // /*!< Transmission Complete Clear Flag */
		uint32_t TCBGTCF       : 1; // /*!< Transmission Complete Before Guard Time Clear Flag */
		uint32_t LBDCF         : 1; // /*!< LIN Break Detection Clear Flag */
		uint32_t CTSCF         : 1; // /*!< CTS Interrupt Clear Flag */
		uint32_t _reserved10   : 1;
		uint32_t RTOCF         : 1; // /*!< Receiver Time Out Clear Flag */
		uint32_t EOBCF         : 1; // /*!< End Of Block Clear Flag */
		uint32_t UDRCF         : 1; // /*!< SPI Slave Underrun Clear Flag */
		uint32_t _reserved14   : 3;
		uint32_t CMCF          : 1; // /*!< Character Match Clear Flag */
		uint32_t _reserved18   : 2;
		uint32_t WUCF          : 1; // /*!< Wake Up from stop mode Clear Flag */
		uint32_t _reserved21   :11;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_usart_type_a,icr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_usart_type_a,icr),bits);

typedef union {
	struct {
		uint32_t RDR           : 9; // RDR[8:0] bits (Receive Data value)
		uint32_t _reserved9    :23;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_usart_type_a,rdr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_usart_type_a,rdr),bits);

typedef union {
	struct {
		uint32_t TDR           : 9; // TDR[8:0] bits (Transmit Data value)
		uint32_t _reserved9    :23;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_usart_type_a,tdr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_usart_type_a,tdr),bits);

typedef union {
	struct {
		uint32_t PRESCALER     : 4; // /*!< PRESCALER[3:0] bits (Clock prescaler) */
		uint32_t _reserved4    :28;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_usart_type_a,presc);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_usart_type_a,presc),bits);

typedef union {
	struct {
		REGDEF_NAME(com_usart_type_a,cr1) CR1;
		REGDEF_NAME(com_usart_type_a,cr2) CR2;
		REGDEF_NAME(com_usart_type_a,cr3) CR3;
		REGDEF_NAME(com_usart_type_a,brr) BRR;
		REGDEF_NAME(com_usart_type_a,gtpr) GTPR;
		REGDEF_NAME(com_usart_type_a,rtor) RTOR;
		REGDEF_NAME(com_usart_type_a,rqr) RQR;
		REGDEF_NAME(com_usart_type_a,isr) ISR;
		REGDEF_NAME(com_usart_type_a,icr) ICR;
		REGDEF_NAME(com_usart_type_a,rdr) RDR;
		REGDEF_NAME(com_usart_type_a,tdr) TDR;
		REGDEF_NAME(com_usart_type_a,presc) PRESC;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(stm32com,usart_type_a);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(stm32com,usart_type_a)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,usart_type_a), CR1) != 0, "Offset mismatch for CR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,usart_type_a), CR2) != 4, "Offset mismatch for CR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,usart_type_a), CR3) != 8, "Offset mismatch for CR3");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,usart_type_a), BRR) != 12, "Offset mismatch for BRR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,usart_type_a), GTPR) != 16, "Offset mismatch for GTPR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,usart_type_a), RTOR) != 20, "Offset mismatch for RTOR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,usart_type_a), RQR) != 24, "Offset mismatch for RQR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,usart_type_a), ISR) != 28, "Offset mismatch for ISR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,usart_type_a), ICR) != 32, "Offset mismatch for ICR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,usart_type_a), RDR) != 36, "Offset mismatch for RDR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,usart_type_a), TDR) != 40, "Offset mismatch for TDR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,usart_type_a), PRESC) != 44, "Offset mismatch for PRESC");
